The  LabelUtils  type exposes the following members.
 Methods
Name  |   Description
Dispose
 Releases all resources used by the  LabelUtils
Equals
 Determines whether the specified  Object  is equal to the current  Object  .
 (Inherited from  Object  .)
GetHashCode
 Serves as a hash function for a particular type.
 (Inherited from  Object  .)
GetLabelFor(BuiltInParameter)
 Gets the user-visible name for a BuiltInParameter.
GetLabelFor(BuiltInParameterGroup)
 Gets the user-visible name for a BuiltInParameterGroup.
GetLabelFor(DisplayUnitType)
 Gets the user-visible name for a DisplayUnitType.
GetLabelFor(ParameterType)
 Gets the user-visible name for a ParameterType.
GetLabelFor(UnitSymbolType)
 Gets the user-visible name for a UnitSymbolType.
GetLabelFor(UnitType)
 Gets the user-visible name for a UnitType.
GetLabelFor(DuctLossMethodType, Document)
 Gets the user-visible name for a DuctLossMethodType.
GetLabelFor(gbXMLBuildingType, Document)
 Gets the user-visible name for a gbXMLBuildingType.
GetLabelFor(PipeFlowState, Document)
 Gets the user-visible name for a PipeFlowState.
GetLabelFor(PipeLossMethodType, Document)
 Gets the user-visible name for a PipeLossMethodType.
GetStructuralSectionShapeName
 Gets the user-visible name for a StructuralSectionShape.
GetType
 Gets the  Type  of the current instance.
 (Inherited from  Object  .)
ToString
 Returns a string that represents the current object.
 (Inherited from  Object  .)
 Properties
Name  |   Description
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 See Also
  LabelUtils Class
  Autodesk.Revit.DB Namespace